<html>
<head>
<title>LaTeX4Web 1.4 OUTPUT</title>
<style type="text/css">
<!--
 body {color: black;  background:"#FFCC99";  }
 div.p { margin-top: 7pt;}
 td div.comp { margin-top: -0.6ex; margin-bottom: -1ex;}
 td div.comb { margin-top: -0.6ex; margin-bottom: -.6ex;}
 td div.norm {line-height:normal;}
 td div.hrcomp { line-height: 0.9; margin-top: -0.8ex; margin-bottom: -1ex;}
 td.sqrt {border-top:2 solid black;
          border-left:2 solid black;
          border-bottom:none;
          border-right:none;}
 table.sqrt {border-top:2 solid black;
             border-left:2 solid black;
             border-bottom:none;
             border-right:none;}
-->
</style>
</head>
<body>
\documentclass[a4paper,fleqn,12pt]report

\usepackage[frenchb, english]babel \usepackage[utf8]inputenc \usepackage[T1]fontenc \usepackagelmodern \usepackageulem \usepackage[usenames,dvipsnames,svgnames,table]xcolor 
\usepackagecsquotes \usepackageamssymb \usepackagelistings \usepackagelistingsutf8
\usepackageamsmath \usepackageamsfonts \newcolumntypeM[1]><font face=symbol>®</font>ggedrightm#1
\lstset
  language=Java,
  basicstyle=\ttfamily,
  columns=fullflexible,
  frame=single,
  breaklines=true,
  postbreak=\mbox\space,
  numbers=left,
  numberstyle=\tiny,
  showspaces=false,
  showtabs=false,
  showstringspaces=false,
  breakatwhitespace=true,
  commentstyle=\colorMidnightBlue,
  keywordstyle=\colorblue,
  stringstyle=\colorForestGreen,
  moredelim=[il][\textcolorgray]\\,
  moredelim=[is][\textcolorgray]\%\%\%\%,
  literate=         &eacute;&eacute;1
         &egrave;&egrave;1
         ú\<font face=symbol>¢</font>u1   
         &ugrave;&ugrave;1
         Á\<font face=symbol>¢</font>A1
         É\<font face=symbol>¢</font>E1
         &ecirc;\<sup>e</sup>1
         Ê\<sup>E</sup>1

\lstdefinelanguagejson
    basicstyle=\normalfont\ttfamily,
    numbers=left,
    numberstyle=\scriptsize,
    stepnumber=1,
    numbersep=8pt,
    showstringspaces=false,
    breaklines=true,
    frame=lines,
    backgroundcolor=\colorwhite,
    literate=
     *0\colorMidnightBlue01
      1\colorMidnightBlue11
      2\colorMidnightBlue21
      3\colorMidnightBlue31
      4\colorMidnightBlue41
      5\colorMidnightBlue51
      6\colorMidnightBlue61
      7\colorMidnightBlue71
      8\colorMidnightBlue81
      9\colorMidnightBlue91
      :\colorblack:1
      ,\colorblack,1
      {\colorForestGreen{1
      }\colorForestGreen}1
      [\colorForestGreen[1
      ]\colorForestGreen]1,
      literate=         &eacute;&eacute;1
         &egrave;&egrave;1
         ú\<font face=symbol>¢</font>u1
         &ugrave;&ugrave;1
         Á\<font face=symbol>¢</font>A1
         É\<font face=symbol>¢</font>E1
         &ecirc;\<sup>e</sup>1
         Ê\<sup>E</sup>1

\usepackageenumitem \setlist[itemize]noitemsep, topsep=0pt
\setlist[enumerate]noitemsep, topsep=0pt
\setlist[description]noitemsep, topsep=0pt
\usepackage[sc,footnotesize]caption \usepackagesubfig \usepackagelongtable \usepackagemulticol \usepackagemultirow \usepackagecaption \usepackageslashbox \usepackagegraphicx \usepackagerotating
\usepackageepstopdf
\usepackagewrapfig

\usepackagefancybox
\graphicspathfigures/ 
\usepackagelscape
\usepackagesetspace
\usepackageverbatim

<font face=symbol>®</font>ggedbottom

\usepackage[top=2cm, bottom=2cm, left=2cm, right=2cm ]geometry 
\pagestyleheadings

\DeclareUnicodeCharacter00A0 
\usepackageparskip
<br>skip = 10pt <br>indent = 0pt 
\usepackagetitlesec
\titleformat*\section<font size="+2">\scshape</font>
\titleformat*\subsection<font size="+1">\scshape</font>
\titleformat*\subsubsection\scshape

\pagestyleplain
\selectlanguagefrenchb
\authorGilles Bodart
\date\today
\titleArchipelago
\begindocument
\thispagestyleempty

\begincenter
\textscUniversit&eacute; de Namur<br>

Facult&eacute; d<font face=symbol>¢</font>informatique<br>

Ann&eacute;e acad&eacute;mique 2017--2018
\endcenter
\vspace1.3cm
\hspace1.4cm
\begincenter
\fbox
\beginminipage[c][5.4cm]11cm
<font size="+1">
\beginspacing1.2
\begincenter
\textbfArchipelago : Un framework de peristence pour bases de donn&eacute;es orient&eacute;es graph.
<br>

\vspace0.5cm
Gilles Bodart
\endcenter
\endspacing
\endminipage
</font>
\endcenter


\vspace0.5cm
\beginfigure[!h]
\centering <font face=symbol>Î</font> cludegraphics[width=.4\textwidth]figures/unamur.pdf
\endfigure

<font size="+0">


\vspace0.5cm
\begintable[!h]
\centering
  \begintabular r l 
    Promoteur&nbsp;: &  \rule4cm0.1mm <font size="-1"> (Signature pour approbation du d&eacute;p\<sup>o</sup>t - REE art. 40)</font><br>

    &nbsp;\underline& CLEVE Anthony <br>
<br>

    Co-promoteur&nbsp;: & LAMBIOTTE Renaud  <br>

  \endtabular
\endtable

\vspace0.5cm
\begincenter
M&eacute;moire pr&eacute;sent&eacute; en vue de l<font face=symbol>¢</font>obtention du grade de<br>

Master en Sciences Informatiques.
\endcenter
\tableofcontents
<p><hr>


\chapter*Introduction

De nos jours, les unit&eacute;s de stockages sont de plus en plus accessible au grand public, les diff&eacute;rentes entreprises impliqu&eacute;es dans le d&eacute;veloppement des syst&egrave;mes de gestion de base de donn&eacute;es l<font face=symbol>¢</font>ont bien compris. Depuis plusieurs ann&eacute;es, L<font face=symbol>¢</font>h&eacute;g&eacute;monie des bases de donn&eacute;es relationnelles se fait de moins en moins &eacute;crasante, le solutions alternatives du NoSql s&eacute;duisent jours apr&egrave;s jours de grandes entreprises. 

La grande force des SGBDR provient des fondement th&eacute;orique mis en place en 1970 par Edgar Frank Codd, IBM d&eacute;fini le langage "Structured Query Language" (SQL) pour utiliser ce syst&egrave;me. Cette normalisation de la repr&eacute;sentation de l<font face=symbol>¢</font>information g&eacute;n&egrave;re un sentiment de sûret&eacute; pour les architectes de logiciels.

A contrario, le mouvement NoSql pour "Not Only SQL" ne se base pas sur un fondement th&eacute;orique commun. Que ce soit la th&eacute;orie des graphs, les syst&egrave;mes de hash key/value avec partitions, ... chaque syst&egrave;me choisit ce sur quoi il va se baser. Mais si il existait une sorte de contrat liant les SGBD NoSql entre eux afin d<font face=symbol>¢</font>assurer une coh&eacute;rence d<font face=symbol>¢</font>utilisation, ce m&eacute;moire va se concentrer sur les impl&eacute;mentations de la th&eacute;orie des graph, en essayant de mettre en place un syst&egrave;me de comparaison, nous allons tenter de sp&eacute;cifier certains objectifs commun et d&eacute;velopper un framework Java permettant d<font face=symbol>¢</font>utiliser de mani&egrave;re agnostique l<font face=symbol>¢</font>une ou l<font face=symbol>¢</font>autre base de donn&eacute;e.
 
\<br>État de l<font face=symbol>¢</font>art

\chapterL<font face=symbol>¢</font>&eacute;volution du NoSql
<a name="refNoSqlEvol">


Un SGBD est par d&eacute;finition un ensemble de proc&eacute;d&eacute;s permettant d<font face=symbol>¢</font>organiser et de stocker des informations (potentiellement de gros volumes). Si stocker et retrouver l<font face=symbol>¢</font>information est un des plus grand challenge d<font face=symbol>¢</font>un SGBD, une communaut&eacute; de d&eacute;veloppeur, pensent que ces syst&egrave;me devraient pouvoir offrir d<font face=symbol>¢</font>autres fonctionnalit&eacute;s. 

A partir des ann&eacute;es 1980, le mod&egrave;le relationnelle supplante les autres formes de structures de donn&eacute;e.

Les &eacute;volutions logicielles suivant naturellement les &eacute;volutions mat&eacute;rielles, la g&eacute;n&eacute;ralisation des interconnexion des r&eacute;seaux, l<font face=symbol>¢</font>augmentation de la bande passante, la diminution du cout des machines, la miniaturisation des espaces de stockage, ... de nouvelles opportunit&eacute;s sont arriv&eacute; au XXI\upe si&egrave;cle.

Les entreprises comme Google, Amazon, Facebook, Twitter, ... sont tour &agrave; tour arriv&eacute;s aux limites du mod&egrave;le Relationnel. Que ce soit a cause de volumes astronomiques (plus de 100 p&eacute;taoctets ) ou du nombre de requ&ecirc;tes par secondes, il fallut d&eacute;velopper une nouvelle façon de g&eacute;rer les donn&eacute;es.

Le NoSql d&eacute;coule de ce genre de probl&egrave;mes, ces mod&egrave;les arrivent avec des approche optimis&eacute;e pour des secteurs sp&eacute;cifiques. <br>

Comme ces mod&egrave;les repr&eacute;sentent ce qui n<font face=symbol>¢</font>est pas Relationnel, par soucis de classification, nous allons distinguer 4 usages principaux :

<ul>

<li> Performances : L<font face=symbol>¢</font>objectif du SGBD sera d<font face=symbol>¢</font>augmenter au maximum les performances de la manipulation des donn&eacute;es. 

<li> Structures simples : Pour s<font face=symbol>¢</font>affranchir de la rigidit&eacute; du mod&egrave;le relationnel, la structure sera g&eacute;n&eacute;ralement simplifi&eacute;e, en utilisant une repr&eacute;sentation plus souple comme le JSON par exemple.

<li> Structures sp&eacute;cifiques : Certain moteur NoSql sont li&eacute;s a des besoins sp&eacute;cifiques, la structure de repr&eacute;sentation de donn&eacute;e sera d&egrave;s lors focalis&eacute;e sur un cas d<font face=symbol>¢</font>utilisation.

<li> Volum&eacute;tries : Un des principal aspect important des SGBD NoSql est leur capacit&eacute; de g&eacute;rer la mont&eacute;e en charge de donn&eacute;es. La distribution des traitements au travers de plusieurs clusters est un facteur tr&egrave;s important dans la plupart des applications BigData.
</ul> 

Et nous allons aussi distinguer 4 grandes familles de repr&eacute;sentation de Sch&eacute;ma de donn&eacute;es :

<ul>

<li> Document : L<font face=symbol>¢</font>utilisation de format sp&eacute;cifiques tels que le tr&egrave;s rependu JSON permet de stocker les donn&eacute;es sur base de fichier.

<li> Cl&eacute; / Valeur : Le syst&egrave;me le plus simple, il manipule des paires de cl&eacute;/valeurs, ou acc&egrave;de &agrave; un &eacute;l&eacute;ment en fonction d<font face=symbol>¢</font>une table de hachage.

<li> Colonne : Inspir&eacute; de Google BigTable, la structure ressemble &agrave; la table relationnelle. On peut la comparer &agrave; une table de hachage qui va r&eacute;f&eacute;rencer une ou plusieurs colonnes.

<li> Graph : La famille Graph se distingue du fait que les entit&eacute;s ne sont pas consid&eacute;r&eacute; comme des entit&eacute;s ind&eacute;pendante, mais que la relation &ecirc;tre ces objets est tout aussi important que le contenu.
</ul> 

Les impl&eacute;mentations de bases de donn&eacute;es de types graph sont de plus en plus nombreuses, les relations entre les &eacute;l&eacute;ments permettent de parcourir le graph de mani&egrave;re tr&egrave;s performante les rendent de plus en plus int&eacute;ressante pour les entreprises poss&eacute;dant des millions de donn&eacute;es. L<font face=symbol>¢</font>utilisation de ce genre de SGBD est d&egrave;s lors tout a fait recommand&eacute; pour des entreprises int&eacute;ress&eacute; entre les relations de ces donn&eacute;s tels que des profils sociaux, des liens de cause a effet, des liens g&eacute;ographiques et bien d<font face=symbol>¢</font>autre.

<h1>Pourquoi utiliser une BDOG plutôt qu<font face=symbol>¢</font>une BD relationnelle comme Oracle ou MySql ?</h1>

L<font face=symbol>¢</font>utilisation des SGBD relationnelle pour tout type de probl&egrave;me est r&eacute;volue. Gr&acirc;ce &agrave; l<font face=symbol>¢</font>apparition de SGBD NoSQL sp&eacute;cifique permet d&egrave;s &agrave; pr&eacute;sent une approche plus personnalis&eacute;e. En effet, comme tout syst&egrave;me, le relationnelle a ses limites, l<font face=symbol>¢</font>approche actuelle des entreprises est plus orient&eacute; "Big Data", elles veulent tout stocker afin d<font face=symbol>¢</font>avoir le plus d<font face=symbol>¢</font>informations possible, or du fait que le relationnelle cadenasse les donn&eacute;es dans une table pr&eacute;alablement d&eacute;finie, on se doit de tronquer l<font face=symbol>¢</font>information ou alors, mettre a jour le sch&eacute;ma de d&eacute;finition des tables. Dans une BDOG tel que Neo4J, nous pouvons ajouter toutes les informations que nous voulons sans condition pr&eacute;alable, cette approche oriente plus un contrôle de l<font face=symbol>¢</font>int&eacute;grit&eacute; des donn&eacute;e aux applications.

Si l<font face=symbol>¢</font>objectif de l<font face=symbol>¢</font>applicatif est de repr&eacute;senter un syst&egrave;me r&eacute;cursif comme une arborescence de fichier, de la g&eacute;n&eacute;alogie, ... le mod&egrave;le relationnelle se basera sur une table faisant r&eacute;f&eacute;rence &agrave; elle m&ecirc;me, l<font face=symbol>¢</font>utilisateur devra donc r&eacute;aliser une jointure par profondeur, si l<font face=symbol>¢</font>arborescence descend jusqu<font face=symbol>¢</font>&agrave; 15 niveau, cela peut devenir probl&eacute;matique. L<font face=symbol>¢</font>approche BDOG permet de parcourir une arborescence sans pour autant charger l<font face=symbol>¢</font>ensemble des nœuds ayant le m&ecirc;me label, plus besoins de projection ensembliste pour pouvoir continuer le chemin.

En relationnel, il existe de nombreux moyen d<font face=symbol>¢</font>historiser les donn&eacute;es, cependant, lorsque le sch&eacute;ma comprend des relations cycliques, cette op&eacute;ration devient plus complexe. L<font face=symbol>¢</font>utilisation d<font face=symbol>¢</font>un BDOG rend ça plus simple, il suffit de cr&eacute;er un nouveau noeud avec les anciennes donn&eacute;es, lier ce noeud avec une relation historique en y sp&eacute;cifiant la date de mise &agrave; jour et ensuite changer les valeur du noeud r&eacute;f&eacute;renc&eacute; par le cycle. Ce proc&eacute;d&eacute; peut &ecirc;tre mis au point dans n<font face=symbol>¢</font>importe quelle repr&eacute;sentations et ne n&eacute;cessite aucune refonte globale du mod&egrave;le de donn&eacute;e.

<h1>On parle de Base de donn&eacute;e orient&eacute;e graph mais quelle est la diff&eacute;rence entre une relation entre deux noeud et une relation entre deux table ?</h1>
Les relations entre deux tables se font &agrave; l<font face=symbol>¢</font>aide de cl&eacute; &eacute;trang&egrave;re d&eacute;finie lors de la cr&eacute;ation du sch&eacute;ma de donn&eacute;es elles apporte de l<font face=symbol>¢</font>information suppl&eacute;mentaire en permettant de r&eacute;aliser des jointure entre plusieurs tables. 

La relation dans les BDOG est une information &agrave; part enti&egrave;re, elle peut poss&eacute;der autant de donn&eacute;e que le noeud lui m&ecirc;me, la force de ce genre de syst&egrave;me est de pouvoir lier deux noeud distinct par n<font face=symbol>¢</font>importe quelle relation et ce &agrave; tout moment. 

\chapterBackgroud technique
<p><a name="toc.1"><h1>1&nbsp;Neo4J</h1>

<p><a name="toc.1.1"><h2>1.1&nbsp;Description</h2>

Cr&eacute;&eacute; par Neo Technologie, une soci&eacute;t&eacute;e su&eacute;do-am&eacute;ricaine, elle est actuellement (selon db-engines.com) la base de donn&eacute;e orient&eacute; graph la plus utilis&eacute;e dans le monde. D&eacute;velopp&eacute; en java sous licence GPL V3, AGPL ou licence commerciale, Neo4J repr&eacute;sente les donn&eacute;es sous formes de "Noeuds" et de "Relations", chacun de ces &eacute;l&eacute;ments peuvent contenir une ou plusieurs propri&eacute;t&eacute;s. Les propri&eacute;t&eacute;s sont des couples cl&eacute;s/valeurs de type simple, comme des chaines de caract&egrave;res ou des valeurs num&eacute;riques, des coordonn&eacute;es spatiales, ... 

Une des particularit&eacute; de Neo4J est l<font face=symbol>¢</font>absence de structure d&eacute;finie, un noeud peut &ecirc;tre labellis&eacute; afin de permettre de travailler sur un ensemble d<font face=symbol>¢</font>&eacute;l&eacute;ments, mais il n<font face=symbol>¢</font>y aura aucune contrainte sur les propri&eacute;t&eacute;s du noeud. Cette particularit&eacute; rend ce SGBD bien adapt&eacute; pour les mod&egrave;les &eacute;voluant fr&eacute;quemment.

<p><a name="toc.1.2"><h2>1.2&nbsp;Langage de requ&ecirc;te</h2>

Le langage propre &agrave; Neo4J se nomme "Cypher"<a name="refCypher">
, il a pour but de r&eacute;aliser plus simplement que SQL les op&eacute;rations de parcours ou d<font face=symbol>¢</font>analyse de proximit&eacute;.

\beginlstlisting[language=java, frame=single]
CREATE (mamours:Person name:"Mamours")
CREATE (mamyco:Person name:"Mamyco")
CREATE (gilles:Person name:"Gilles")
CREATE (marie:Person name:"Marie")
CREATE (bebe:Person name:"Enfant")
CREATE (mamours)-[:PARENT_OF]->(gilles)
CREATE (mamyco)-[:PARENT_OF]->(marie)
CREATE (marie)-[:PARENT_OF]->(bebe)
CREATE (gilles)-[:PARENT_OF]->(bebe)
\endlstlisting

Ces requ&ecirc;tes vont cr&eacute;er 5 noeud et 4 relations PARENT\_OF, nous pouvons ais&eacute;ment comprendre que "Mamyco" est parente de "Marie"

\beginlstlisting[language=java, frame=single]
MATCH (p:Person)-[:PARENT_OF]->(c:Person) 
RETURN DISTINCT (p)
	
\endlstlisting

Cette query va retourner tout les nœuds distinct qui ont une relation :PARENT\_OF avec un autre noeud.

\beginlstlisting[language=java, frame=single]
MATCH (gp:Person)-[:PARENT_OF*2]->(c:Person) 
RETURN DISTINCT (gp)
	
\endlstlisting

Celle-ci quant &agrave; elle va retourner toutes les personnes qui sont parent de parent et donc grand parents. 

ces deux exemples peuvent montrer la force de l<font face=symbol>¢</font>utilisation d<font face=symbol>¢</font>un SGBD de type graph pour repr&eacute;senter un ensemble hierarchique de donn&eacute;es par rapport au SGBD relationnelles qui n&eacute;cessiterai une double jointure sur la Table "Person".

<p><a name="toc.1.3"><h2>1.3&nbsp;Communication</h2>

Neo4J peut &ecirc;tre utilis&eacute; sous plusieurs formes. 

La premi&egrave;re option est une solution embarqu&eacute;e, ce choix peut &ecirc;tre tr&egrave;s int&eacute;ressant en alternatif au tr&egrave;s c&eacute;l&egrave;bre SQLite relationnel.

La deuxi&egrave;me, pour toute application distribu&eacute;e, est une solution autonome pouvant tourner comme un service sur tout type de plateforme. Le protocol "Bolt", d&eacute;velopp&eacute; par "N&eacute;o Technologie" est grandement conseill&eacute; pour communiquer avec ces serveurs distants. 

Son utilisation est simple gr&acirc;ce &agrave; l<font face=symbol>¢</font>utilisation de la libraire native &agrave; N&eacute;o4J pour java (neo4j-java-drive) ou avec l<font face=symbol>¢</font>utilisation de l<font face=symbol>¢</font>API Rest d&eacute;ploy&eacute;e en m&ecirc;me temps que le SGBD.

<p><a name="toc.2"><h1>2&nbsp;OrientDB</h1>

<p><a name="toc.2.1"><h2>2.1&nbsp;Description</h2>

OrientDB est un SGBD initialement d&eacute;velopp&eacute; en C++(Orient ODBMS) ensuite repris en 2010 en Java par Luca Garulli dans une version multi-mod&egrave;le sous licence Apache 2.0, GPL et AGPL. actuellement 3&egrave;me mondial (selon db-engines.com) il offre de nombreuses fonctionnalit&eacute;s int&eacute;ressante. 

OrientDB est base de donn&eacute;e associant Document et Graph. Elle combine la rapidit&eacute; et la flexibilit&eacute; du type document ainsi que les fonctionnalit&eacute;s de relations des bases de donn&eacute;es graph. 

Ce SGBD est compos&eacute; de trois grands &eacute;l&eacute;ments 

<ul>

<li> Document \& Vertex : Source de contenu, ces &eacute;lements peuvent &ecirc;tre consid&eacute;r&eacute; comme des container de donn&eacute;es, on peut le comparer avec la ligne d<font face=symbol>¢</font>une base de donn&eacute;es relationnelle.

<li> Links \& Edge : Une arr&ecirc;te orient&eacute;s reliant deux &eacute;l&eacute;ments non n&eacute;cessairement distinct.

<li> Property : Typ&eacute;e ou embarqu&eacute;e dans un document JSON, ceci va repr&eacute;senter le contenu de l<font face=symbol>¢</font>information. Ces propri&eacute;t&eacute;s sont bien entendu primordiales pour ordonner, rechercher, ...
</ul>

Chaque Document ou Vertex appartient &agrave; une "Class", celle-ci peut &ecirc;tre strictement d&eacute;finie ou plus laxiste. Comme dans la programmation orient&eacute;e objet, OrientDB offre le principe de polymorphisme avec un syst&egrave;me d<font face=symbol>¢</font>h&eacute;ritage entre les classes. 

OrientDB vient dans sa version community avec un syst&egrave;me de clustering permettant &agrave; l<font face=symbol>¢</font>utilisateur de correctement g&eacute;rer les mont&eacute;es en charges. chaque document est identifi&eacute; avec une partie d&eacute;signant le cluster dans lequel l<font face=symbol>¢</font>information est stock&eacute;e et une autre partie d&eacute;signant sa position dans ce dernier (exemple @rid: 10:12). Chaque classe peut &ecirc;tre associ&eacute;e a un ou plusieur cluster, permettant d<font face=symbol>¢</font>optimiser les acc&egrave;s dans des ensembles  plus petits.


<p><a name="toc.2.2"><h2>2.2&nbsp;Langage de requ&ecirc;te</h2>

OrientDB utilise une sorte de SQL avanc&eacute;e pour interpr&eacute;ter les requ&ecirc;tes. On peut de plus utiliser le langage Gremlin.

Voici quelques exemples d<font face=symbol>¢</font>utilisation du SQL avanc&eacute; dans OrientDB.

\beginlstlisting[language=SQL]
CREATE CLASS Person EXTENDS V
CREATE CLASS Company EXTENDS V
CREATE CLASS WorkAt EXTENDS E
CREATE PROPERTY Person.firstname string
CREATE PROPERTY Person.lastname string
CREATE PROPERTY Company.name string
INSERT INTO Person(firstname, lastname) VALUES ("Gilles","Bodart"),("Marie","Van Cutsem")
	ou
INSERT INTO Company set name = "ACME"

\endlstlisting

Cet ensemble de requ&ecirc;te ressemblant au langage SQL permet de cr&eacute;er deux vertex, Person et Company , un Edge WorkAt et leur associe certaine propri&eacute;t&eacute;s. Les deux types d<font face=symbol>¢</font>insert diff&eacute;rent permettent comme en SQL d<font face=symbol>¢</font>ajouter un noeud.  

\beginlstlisting[language=SQL]
SELECT FROM V
\endlstlisting
\begincenter
	\begintabular|c|c|c|c|c|c|
   		\hline
  		<font face=symbol>m</font>lticolumn3|c|Metadata & <font face=symbol>m</font>lticolumn3c|Properties <br>

   		\hline
   		@rid & @version & @class & firstname & lastname & name <br>

   		\hline
   		10:0 & 1 & Person & Marie & Van Cutsem &  <br>

   		10:1 & 1 & Person & Gilles & Bodart &  <br>

   		11:0 & 1 & Company &  &  & ACME <br>

   		\hline
	\endtabular
\endcenter

Nous pouvons observer qu<font face=symbol>¢</font>OrientDB se charge de qualifier les document de plusieurs m&eacute;tadata en leur octroyant par exemple un identifiant unique (\no cluster:position), un num&eacute;ro de version pour permettre une gestion de transaction "full optimistic" <font size="-1"><i>On laisse l<font face=symbol>¢</font>utilisateur continuer sa transaction et le refus se fera lors du commit si il y a eu une modification concurrente du m&ecirc;me document</i></font> et le \@class repr&eacute;sente la structure du document.

\beginlstlisting[language=SQL]
CREATE Edge WorkAt from 10:1 to 11:0
\endlstlisting

Cette petite requ&ecirc;te va lier le document ayant l<font face=symbol>¢</font>id 10:1 au document dont l<font face=symbol>¢</font>id est 11:0 par une relation WorkAt. Nous pouvons traduire en français que Marie Van Cutsem travaille chez ACME.


<p><a name="toc.2.3"><h2>2.3&nbsp;Communication</h2>

OrientDB embarque une API Rest compl&egrave;te, toute actions pouvant &ecirc;tre faite sur les interfaces web et consoles peuvent &ecirc;tre reproduites au travers de cette API. 


\chapterSolutions existantes


<p><a name="toc.3"><h1>3&nbsp;Les librairies</h1> 

<p><a name="toc.3.1"><h2>3.1&nbsp;Hibernate</h2>

Hibernate, soutenu et d&eacute;velopp&eacute; par JBoss, &agrave; mis au point un syst&egrave;me de relation entre le code Java et le SGBD N&eacute;o4J, en r&eacute;utilisant les m&ecirc;mes annotations de relations que celles employ&eacute;es pour les bases de donn&eacute;es relationnelles, &agrave; savoir :

<ul>

<li> @OneToOne : Relation 1-1

<li> @ManyToOne : Relation n-1

<li> @OneToMany : Relation 1-n

<li> @ManyToMany : Relation n-n
</ul>

Bien qu<font face=symbol>¢</font>&agrave; l<font face=symbol>¢</font>heure actuelle, aucune int&eacute;gration avec OrientDB, un ticket est ouvert (OGM-855) depuis 2 ans aupr&egrave;s d<font face=symbol>¢</font>Hibernate.

<p><a name="toc.3.2"><h2>3.2&nbsp;Spring Data</h2>

Spring data &agrave; nouveau poss&egrave;de un module de communication avec le SGBD N&eacute;o4J, il int&egrave;gre au c&eacute;l&egrave;bre Framework Spring les fonctionnalit&eacute;s de N&eacute;o4J-OGM <font size="-1"><i>Object Graph Mapper</i></font>, permettant de qualifier une classe avec certaines annotations facilitant la s&eacute;r&eacute;alisation et le d&eacute;s&eacute;r&eacute;alisation vers la repr&eacute;sentation graphique.

Exemple : 

\beginlstlisting
@NodeEntity(label="Film")
public class Movie 

   @GraphId Long id;

   @Property(name="title")
   private String name;


@NodeEntity
public class Actor extends DomainObject 

   @GraphId
   private Long id;

   @Property(name="name")
   private String fullName;

   @Relationship(type="ACTED_IN", direction=Relationship.OUTGOING)
   private List<Role> filmography;



@RelationshipEntity(type="ACTED_IN")
public class Role 
    @GraphId   
    private Long relationshipId;
    @Property  
    private String title;
    @StartNode 
    private Actor actor;
    @EndNode   
    private Movie movie;

\endlstlisting

<p><a name="toc.3.3"><h2>3.3&nbsp;Librairie Neo4J</h2>

Une librairie java d&eacute;velopp&eacute;e par NeoTechnologie existe, elle permet de travailler ais&eacute;ment avec une base de donn&eacute;e Neo4J embarqu&eacute;e ou &agrave; distance. Elle est en constante &eacute;volution et se trouve sur une plateforme open source. 

Exemple de communication avec la librairie Neo4J le protocol "Bolt":

\beginlstlisting[language=java]
Driver driver = GraphDatabase.driver("bolt://localhost:7687", AuthTokens.basic("matrix", "neo"));
Session session = driver.session();
session.run("CREATE (a:Person firstName:name,lastName:lastName)", parameters("firstName","Gilles","lastName","Bodart"));
session.close();
driver.close();

\endlstlisting

Bien que cette libraire soit efficace, elle ne peut &ecirc;tre utilis&eacute;e avec un autre SGBD. 

<p><a name="toc.3.4"><h2>3.4&nbsp;Librairie OrientDB</h2>

La librairie OrientDB pour java est compos&eacute;e de trois &eacute;l&eacute;ments:

<ul>

<li> Graph API

<li> Document API

<li> Object API
</ul>

La graph API d<font face=symbol>¢</font>OrientDB couvre 80\% des uses cases classique d<font face=symbol>¢</font>un utilisateur, elle supporte tout les mod&egrave;les de repr&eacute;sentations comme un unique multi-modele de donn&eacute;e. Elle travaille sur des "Vertex" et des "Edges", respectivement nœud et relations et est compatible avec le standard TinkerPop

La document API elle permet de couvrir les 20\% restants, elle est plus simple d<font face=symbol>¢</font>utilisation mais n<font face=symbol>¢</font>offre une utilisation plus atomique, les relations ne peuvent par exemple qu<font face=symbol>¢</font>&ecirc;tre unidirectionnelles tandis que la bidirectionnalit&eacute; est offerte dans l<font face=symbol>¢</font>API pr&eacute;c&eacute;dent. Un document est un &eacute;l&eacute;ment unique, pour g&eacute;rer les relations entre les diff&eacute;rents nœuds de notre mod&egrave;le, il faudra g&eacute;rer manuellement chaque connexion.

La derni&egrave;re librairie se focalise sur les objets java, elle n<font face=symbol>¢</font>a plus &eacute;t&eacute; am&eacute;lior&eacute;e depuis la version 1.5 d<font face=symbol>¢</font>OrientDB <font size="-1"><i>À l<font face=symbol>¢</font>heure de l<font face=symbol>¢</font>&eacute;criture de ce m&eacute;moire, nous sommes &agrave; la version 2.2 et la version 3 &agrave; bientôt fini sa phase de "b&ecirc;ta test"</i></font>

<p><a name="toc.4"><h1>4&nbsp;Les frameworks</h1>

<p><a name="toc.4.1"><h2>4.1&nbsp;Apache TinkerPop</h2>

Apache TinkerPop est Framework open source d<font face=symbol>¢</font>utilisation de graph, il regroupe un grand ensemble de fonctionnalit&eacute;s et d<font face=symbol>¢</font>algorithmes. Son &eacute;cosyst&egrave;me est de plus en plus agr&eacute;ment&eacute; de librairies externes d&eacute;velopp&eacute;es par de tierces personnes.

Il se consid&egrave;re lui-m&ecirc;me comme &eacute;tant complexe d<font face=symbol>¢</font>utilisation pour les nouveaux d&eacute;veloppeurs car il n&eacute;cessite l<font face=symbol>¢</font>utilisation d<font face=symbol>¢</font>un environnement qui leur est propre, la "Gremlin-console".

Les d&eacute;veloppeurs de ce framework on mit au point un langage de travail sur les graphs appel&eacute; "Gremlin". Le langage dont nous avons parl&eacute; en section <a href="#refCypher">(0)</a>
 s<font face=symbol>¢</font>est grandement inspirer de ce dernier.

Exemple d<font face=symbol>¢</font>utilisation 

\beginlstlisting
gremlin> g.V() /* r&eacute;cup&egrave;re tout les noeuds du graph */
==>v[1]
==>v[2]
==>v[3]
==>v[4]
==>v[5]
==>v[6]
gremlin> g.V(1) /* r&eacute;cup&egrave;re le noeud d<font face=symbol>¢</font>Id 1 du graph*/
==>v[1]
gremlin> g.V(1).values(<font face=symbol>¢</font>name<font face=symbol>¢</font>) /* r&eacute;cup&egrave;re le noeud d<font face=symbol>¢</font>Id 1 du graph et renvoie sa propri&eacute;t&eacute; <font face=symbol>¢</font>name<font face=symbol>¢</font> */
==>marko
gremlin> g.V(1).outE(<font face=symbol>¢</font>knows<font face=symbol>¢</font>) /* r&eacute;cup&egrave;re les relations <font face=symbol>¢</font>knows<font face=symbol>¢</font> partant du noeud d<font face=symbol>¢</font>Id 1 */
==>e[7][1-knows->2]
==>e[8][1-knows->4]
gremlin> g.V(1).outE(<font face=symbol>¢</font>knows<font face=symbol>¢</font>).inV().values(<font face=symbol>¢</font>name<font face=symbol>¢</font>) /* retourne le nom des personnes que le noeud 1 connait */
==>vadas
==>josh
gremlin> g.V(1).out(<font face=symbol>¢</font>knows<font face=symbol>¢</font>).values(<font face=symbol>¢</font>name<font face=symbol>¢</font>) /* m&ecirc;me r&eacute;sultat */
==>vadas
==>josh
gremlin> g.V(1).out(<font face=symbol>¢</font>knows<font face=symbol>¢</font>).has(<font face=symbol>¢</font>age<font face=symbol>¢</font>, gt(30)).values(<font face=symbol>¢</font>name<font face=symbol>¢</font>) /* retourne le nom des personnes plus vielle que 30 ans que le noeud 1 connait */
==>josh
\endlstlisting

Comme expliqu&eacute; plus haut, le langage doit &ecirc;tre ex&eacute;cut&eacute; dans un invite de commande ou dans un serveur Gremlin, nous sommes d&egrave;s lors contraint d<font face=symbol>¢</font>installer et de configurer ce dernier pour pointer vers l<font face=symbol>¢</font>un ou l<font face=symbol>¢</font>autre SGBD.



\<br>Contribution
\chapterApplication possibles des BDOG

<p><a name="toc.5"><h1>5&nbsp;L<font face=symbol>¢</font>exemple parfait</h1>

Pour la suite de ce m&eacute;moire, il est primordiale d<font face=symbol>¢</font>avoir un exemple concret de mod&egrave;le habituellement persist&eacute; avec un mod&egrave;le relationnelle mais qui serait sans le moindre probl&egrave;me transposable dans une BDOG.

<h2>L<font face=symbol>¢</font>&eacute;cole</h2>

Imaginons la repr&eacute;sentation d<font face=symbol>¢</font>une &eacute;cole compos&eacute;e d<font face=symbol>¢</font>&eacute;l&egrave;ves, de professeurs, de classes, de salles techniques, de travailleurs, ... dont   le diagramme de classes se trouve en Annexe (<a href="#reffig:SchoolDiagram">(0)</a>
).

Les liens entre les diff&eacute;rents objets peuvent &ecirc;tre fortement nombreux, nous pouvons imaginer que les &eacute;tudiants sont amis, membres de famille, ennemis, amoureux, ... de m&ecirc;me que pour les professeurs, ils peuvent avoir les m&ecirc;mes relations que les &eacute;tudiants mais de plus peuvent &ecirc;tre assign&eacute; a des cours, a des classes, ... toutes ces liaisons peuvent &ecirc;tre fortement compliqu&eacute;es &agrave; repr&eacute;senter sur une base de donn&eacute;e relationnelles. L<font face=symbol>¢</font>utilisation d<font face=symbol>¢</font>une BDOG semble &ecirc;tre tout &agrave; fait ad&eacute;quate. Durant la suite de ce m&eacute;moire, nous utiliserons donc ce mod&egrave;le.

<p><a name="toc.6"><h1>6&nbsp;Crit&egrave;res de comparaisons</h1>

Dans un premier temps, il est primordiale de mettre en place une liste de crit&egrave;res permettant de faciliter le choix de la BDOG.

<p><a name="toc.7"><h1>7&nbsp;Comparaison des plus grandes BDOG</h1> 
\begincenter

\begintabular[c]|l|M5cm|M5cm|
\hline
\box Crit&egrave;reBDOG & Neo4J & OrientDB  \tabularnewline
\hline
Schema de donn&eacute;e strict & X & \checkmark  \tabularnewline
\hline
Format de donn&eacute;e & JSON & JSON \tabularnewline
\hline
Principe d<font face=symbol>¢</font>h&eacute;ritage & X & \checkmark \tabularnewline
\hline
Clusturing & Configurable & Natif \tabularnewline
\hline
Communication & BOLT (protocole propri&eacute;taire) & REST (via HTTP) \tabularnewline
\hline
Évolutivit&eacute; & L<font face=symbol>¢</font>absence de sch&eacute;ma strict entra&icirc;ne une grande libert&eacute; dans la cr&eacute;ation et la modification des nœuds & Les classes doivent pr&eacute;alablement configur&eacute;es sur le serveur \tabularnewline \hline
Rapidit&eacute;\footnotemark & 7m 10s & 4m 31s \tabularnewline \hline
Mod&egrave;le de repr&eacute;sentation & Uniquement graph & multimod&egrave;le \tabularnewline \hline

\endtabular
\endcenter
\footnotetext10 000 requ&ecirc;tes sur le m&ecirc;me graph de donn&eacute;e avec la m&ecirc;me requ&ecirc;te au travers d<font face=symbol>¢</font>un appel Java
Une id&eacute;e d<font face=symbol>¢</font>arbre de d&eacute;cision devrait, &agrave; la fin de cette section, permettre &agrave; un utilisateur muni de ses besoins, de choisir la BDOG la plus adapt&eacute;e &agrave; son projet. 

<p><a name="toc.8"><h1>8&nbsp;Piste de normalisation</h1>

Comme nous l<font face=symbol>¢</font>avons pr&eacute;senter dans le point <a href="#refNoSqlEvol">(0)</a>
 nous nous apercevons que le probl&egrave;me principal du NoSql est le manque de standard d<font face=symbol>¢</font>utilisation de ces SGBD, pour ce faire, nous allons tenter de lister un des objectifs de normalisations.

<ul>

<li> Utilisation d<font face=symbol>¢</font>un langage unique

<li> Syst&egrave;me de transaction 

<li> Op&eacute;ration de base de persistances CRUD

<li> Possibilit&eacute; de cr&eacute;er des m&eacute;thodes stock&eacute;e 

<li> Contrôle sur les propri&eacute;t&eacute;s.
</ul>

La suite de ce m&eacute;moire portant sur le d&eacute;veloppement d<font face=symbol>¢</font>un framework java, tentera d<font face=symbol>¢</font>offrir ces objectifs de mani&egrave;re abstraite aux d&eacute;veloppeurs.

\chapterLe framework
<p><a name="toc.9"><h1>9&nbsp;Utilisation</h1>

Ce framework &agrave; &eacute;t&eacute; bas&eacute; sur l<font face=symbol>¢</font>utilisation d<font face=symbol>¢</font>annotations, &agrave; l<font face=symbol>¢</font>heure actuelle, il permet d<font face=symbol>¢</font>effectuer deux op&eacute;rations:

<p><a name="toc.9.1"><h2>9.1&nbsp;La persistance</h2>

La persistance est l<font face=symbol>¢</font>&eacute;l&eacute;ment primordiale de ce framework, afin de ne pas avoir de lien avec une BDOG propre, nous nous sommes bas&eacute; sur le mod&egrave;le orient&eacute; objet. La persistance de celui-ci ainsi que des &eacute;l&eacute;ments qui lui sont li&eacute; est param&eacute;trisation dans un fichier de configuration n&eacute;cessaire &agrave; l<font face=symbol>¢</font>initialisation de cet outil.

Le fichier de configuration doit se nommer "config.archipelago.json" et &ecirc;tre pr&eacute;sent dans les ressources du projet.

Voici le canevas de ce fichier :

\beginlstlisting[language=json]

  "database": 
    "type": "", // Choix entre NEO4J et ORIENT_DB
    "username": "",
    "password": "",
    "url": "",
    "name": "", // Nom de la base de donn&eacute;e
    "embedded": false, // boolean Optionnel
    "port": 1234 // 
  ,
  "deepness": 3, // Profondeur de persistance voir ci-apr&egrave;s
  "domainRootPackage": "org.archipelago.test.domain.school" 
  // package o&ugrave; se trouve les classes du domaine 

\endlstlisting
Afin d<font face=symbol>¢</font>assurer la persistance des &eacute;l&eacute;ments li&eacute;s, nous avons opt&eacute; pour une approche r&eacute;cursive en "depth-first" avec marquage de sommet, en effet, pour cr&eacute;er un lien entre deux &eacute;l&eacute;ments, il faut absolument que ceux si soit pr&eacute;sent dans la base de donn&eacute;e.

La propri&eacute;t&eacute; "deepness" est primordiale pour la performance de ce framework, elle permet de d&eacute;finir la profondeur de persistance d<font face=symbol>¢</font>un objet. Ce proc&eacute;d&eacute; emp&ecirc;che de tomber dans des boucles infinies, courante lorsque nous travaillons avec de mod&egrave;les ayant de relations bidirectionnelles comme suit : 

\beginlstlisting
Archipelago arch = Archipelago.getInstance();

Student gilles = new Student();
Student antoine = new Student();

gilles.setFriend(antoine);
antoine.setFriend(gilles);

arch.persist(gilles);
\endlstlisting

Ainsi avec cette valeur sentinelle nous rompons la boucle de persistance apr&egrave;s avoir atteint la profondeur souhait&eacute;.

\begincenter
 <font face=symbol>Î</font> cludegraphics[scale=0.5]figures/Persist.png
<a name="reffig:Persist">

\endcenter
    
Pour ce qui est de la persistance du lien entre deux objets, nous avons fait le choix de ne cr&eacute;er que des relations orient&eacute;e et unidirectionnelles, pour sp&eacute;cifier cette information de lien, il faut apposer une annotation \textit@Bridge sur la propri&eacute;t&eacute; d<font face=symbol>¢</font>o&ugrave; part le lien. Nous avons cependant ajouter la possibilit&eacute; d<font face=symbol>¢</font>avoir une relation r&eacute;ciproque en sp&eacute;cifiant dans cette annotation que nous voulons que ce soit bidirectionnelle. 

Exemple avec la Classe \textitStudent.java

\beginlstlisting
public class Student extends Person 

    @Bridge(descriptor = "Follow")
    private List<Lesson> lessons = new ArrayList<>();
    
    @Bridge(descriptor = "FriendOf")
    private List<Student> friends = new ArrayList<>();
    
    @Bridge(descriptor = "FamilyMember", biDirectionnal = true)
    private List<? extends Person> familyMember = new ArrayList<>();
    
    @Bridge(descriptor = "PromotedIn")
    private Promotion prom;
    
    ...
    
\endlstlisting

Le descriptor qui est obligatoire, se doit d<font face=symbol>¢</font>&ecirc;tre unique, il va repr&eacute;senter dans le BDOG le type de lien entre deux noeuds.

La beaut&eacute; derri&egrave;re cette utilisation est qu<font face=symbol>¢</font>au moindre changement de mod&egrave;le, comme un ajout de propri&eacute;t&eacute;, l<font face=symbol>¢</font>ensemble de la couche de persistance sera adapt&eacute;e &agrave; ce changement sans devoir ex&eacute;cuter le moindre script (exception de la cr&eacute;ation d<font face=symbol>¢</font>une nouvelle classe pour OrientDB).

<p><a name="toc.9.2"><h2>9.2&nbsp;La r&eacute;cup&eacute;ration</h2>

La r&eacute;cup&eacute;ration de l<font face=symbol>¢</font>information est la raison pour laquelle nous la stockons. A quoi bon enregistrer une valeur dans une base de donn&eacute;e si nous ne souhaitons jamais l<font face=symbol>¢</font>utiliser ult&eacute;rieurement ?

Pour cela, Archipelago vient avec un syst&egrave;me de cr&eacute;ation de requ&ecirc;te. Gr&acirc;ce &agrave; ce proc&eacute;d&eacute;, que votre BDOG soit OrientDB ou Neo4J, vous serez en mesure de r&eacute;cup&eacute;rer votre objet sans changer votre code source. 

Voici un exemple:

\beginlstlisting
Archipelago arch = Archipelago.getInstance();

ArchipelagoQuery aq = a.getQueryBuilder()
                .of(Student.class)
                .build();
List<Object> nodes = arch.execute(aq);
\endlstlisting

Cette requ&ecirc;te va rechercher l<font face=symbol>¢</font>ensemble des &eacute;tudiants de la base de donn&eacute;e ainsi que les objets qui leurs sont li&eacute;s.

Un syst&egrave;me de condition est &eacute;galement mit en place, il permet d<font face=symbol>¢</font>affiner le r&eacute;sultat obtenu: 

\beginlstlisting
Archipelago arch = Archipelago.getInstance();

ArchipelagoQuery aq = a.getQueryBuilder()
                .of(Student.class)
                .where(of("firstName","Gilles"), ConditionQualifier.Equal)
                .build();
List<Object> nodes = arch.execute(aq);
\endlstlisting

Cette requ&ecirc;te va quant &agrave; elle rechercher les &eacute;tudiants ayant "Gilles" comme pr&eacute;nom.

Nous pouvons aussi ajouter des op&eacute;rateurs logique "OU" et "ET" comme suit :
\beginlstlisting
Archipelago arch = Archipelago.getInstance();

ArchipelagoQuery aq = a.getQueryBuilder()
                .of(Student.class)
                .where(of("lastName", "Bodart"), ConditionQualifier.EQUAL)
                .and(of("firstName", "Gilles"), ConditionQualifier.EQUAL)
                .or(of("firstName", "Thomas"), ConditionQualifier.EQUAL)
                .build();
List<Object> nodes = arch.execute(aq);
\endlstlisting

Le proc&eacute;d&eacute; mit en place &agrave; l<font face=symbol>¢</font>heure actuel ne permet pas de faire des conditions fortement complexes, il va ajouter l<font face=symbol>¢</font>&eacute;l&eacute;ment de condition &agrave; la suite de la requ&ecirc;te actuelle, pour l<font face=symbol>¢</font>exemple pr&eacute;c&eacute;dent, nous aurons donc : 

\beginlstlisting[language=SQL]
lastName = "Bodart" AND ( firstName = "Gilles" OR firstName = "Thomas")
\endlstlisting

ce qui se retournera donc la liste des &eacute;tudiants ayant "Bodart" comme nom de famille et "Gilles" ou "Thomas" comme pr&eacute;nom. \`A L<font face=symbol>¢</font>heure actuelle, il n<font face=symbol>¢</font>est cependant pas possible d<font face=symbol>¢</font>effectuer des requ&ecirc;tes sur les relations entre les objets, cette piste est primordiale pour une deuxi&egrave;me version de ce framework.

\begincenter
 <font face=symbol>Î</font> cludegraphics[scale=0.4]figures/query.png
<a name="reffig:Query">

\endcenter

<p><a name="toc.10"><h1>10&nbsp;Schema conceptuel</h1>
Les sch&eacute;mas conceptuels repr&eacute;sentant une mod&egrave;le exemple annot&eacute; des &eacute;l&eacute;ments du framework sera fourni et comment&eacute; dans cette section. Cela permettra au lecteur une meilleur compr&eacute;hension.
<p><a name="toc.11"><h1>11&nbsp;Documentation</h1>
Une documentation claire et pr&eacute;cise sur l<font face=symbol>¢</font>utilisation du framework Archipelago sera pr&eacute;sente dans cette section. Un ensemble entre une documentation fonctionnelle et une documentation technique faite avec JavaDoc.
<p><a name="toc.12"><h1>12&nbsp;Processus</h1>
Description du processus impl&eacute;ment&eacute; sur base d<font face=symbol>¢</font>un exemple claire. Explications des diff&eacute;rents choix d<font face=symbol>¢</font>impl&eacute;mentations et de chaque &eacute;tape.
\chapterEvaluation
<p><a name="toc.13"><h1>13&nbsp;Points forts</h1>
Autocritique du framework, sur base de test qualitatif et ou quantitatif. Evaluations : usability, performence, qualit&eacute;, coh&eacute;rence
<p><a name="toc.14"><h1>14&nbsp;Points faibles</h1>
Autocritique du framework, sur base de test qualitatif et ou quantitatif.
Evaluations : usability, performence, qualit&eacute;, coh&eacute;rence
<p><a name="toc.15"><h1>15&nbsp;Retour d<font face=symbol>¢</font>information</h1>
Si le temps nous le permet, une analyse des retours utilisateur sera faite en fin de m&eacute;moire.
\chapterConclusion
<p><a name="toc.16"><h1>16&nbsp;Piste de r&eacute;flexions</h1>
Une introspection sur le projet sera expliqu&eacute; dans cette section, les id&eacute;es innachev&eacute;s y seront d&eacute;crites en tant que piste de r&eacute;flexions.
<p><a name="toc.17"><h1>17&nbsp;Archipelago en r&eacute;sum&eacute;</h1>
Le m&eacute;moire sera conclu avec un explication transversale et compl&egrave;te du framework, permettant au lecteur de garder une bonne impression sur le nouvel outil que sera ce framework.
\<br>Annexes
\beginsidewaysfigure[ht]
     <font face=symbol>Î</font> cludegraphics[scale=0.8]figures/SchoolDiag.png
    <font face=symbol>Ç</font>tionDiagramme de Classe du mod&egrave;le École
    <a name="reffig:SchoolDiagram">

\endsidewaysfigure
\chapter*Lexique
\begincenter
\begintabular[c] l p14cm 
 SQL  & Structured Query Language <br>
 \hline
 NoSQL  & Not only SQL <br>
 \hline
 SGBD  & Syst&egrave;me de gestion de base de donn&eacute;es <br>
 \hline
 SGBDR  & Syst&egrave;me de gestion de base de donn&eacute;es relationnelles <br>
 \hline
 BDOG  & Base de donn&eacute;e orient&eacute;e graph <br>
 \hline
 JSON  & JavaScript Object Notation <br>
 \hline
 Vertex  & Sommet <br>
 \hline
 Edge  & bord <br>
 \hline
 Cluster  & litt&eacute;ralement grappe, cela repr&eacute;sente en informatique un groupe d<font face=symbol>¢</font>&eacute;l&eacute;ment <br>
 \hline
 API  & Application Programming Interface  <br>
 \hline
 REST  & Representational state transfer, style d<font face=symbol>¢</font>architecture pour les syst&egrave;mes hyperm&eacute;dia distribu&eacute;s <br>
 \hline
\endtabular
\endcenter

\chapter*Code Sources


\chapter*Bibliographie
<ul>

<li> https://neo4j.com/ consult&eacute; &agrave; de nombreuses reprises (Neo Technology, Inc)

<li> https://orientdb.com/ consult&eacute; &agrave; de nombreuses reprises (OrientDB LTD)

<li> https://snap.stanford.edu/data/

<li> https://networkx.github.io/

<li> http://igraph.org/redirect.html

<li> https://snap.stanford.edu/data/egonets-Facebook.html

<li> http://konect.uni-koblenz.de/

<li> https://icon.colorado.edu/\#!/networks

<li> https://neonx.readthedocs.io/en/latest/

<li> J. McAuley and J. Leskovec. Learning to Discover Social Circles in Ego Networks. NIPS, 2012.

<li> J. Leskovec, K. Lang, A. Dasgupta, M. Mahoney. Community Structure in Large Networks: Natural Cluster Sizes and the Absence of Large Well-Defined Clusters. Internet Mathematics 6(1) 29--123, 2009.

<li> https://www.infoq.com/fr/articles/graph-nosql-neo4j

<li> http://www.silicon.fr/base-donnees-nosql-impose-sgbdr-93305.html

<li> https://prezi.com/4flswlgipwbo/nosql-not-only-sql/
<br>LIVRE&nbsp; http://www.eyrolles.com/Chapitres/9782212141559/9782212141559.pdf

<li> https://db-engines.com

<li> https://www.udemy.com/orientdb-getting-started

<li> https://fr.wikipedia.org/wiki/Representational\_state\_transfer
</ul>
\enddocument

<hr>
<p><h1>Table Of Contents</h1>
<p><a href="#toc.1"><h1>1&nbsp;Neo4J</h1></a>
<p><a href="#toc.1.1"><h2>1.1&nbsp;Description</h2></a>
<p><a href="#toc.1.2"><h2>1.2&nbsp;Langage de requ&ecirc;te</h2></a>
<p><a href="#toc.1.3"><h2>1.3&nbsp;Communication</h2></a>
<p><a href="#toc.2"><h1>2&nbsp;OrientDB</h1></a>
<p><a href="#toc.2.1"><h2>2.1&nbsp;Description</h2></a>
<p><a href="#toc.2.2"><h2>2.2&nbsp;Langage de requ&ecirc;te</h2></a>
<p><a href="#toc.2.3"><h2>2.3&nbsp;Communication</h2></a>
<p><a href="#toc.3"><h1>3&nbsp;Les librairies</h1></a>
<p><a href="#toc.3.1"><h2>3.1&nbsp;Hibernate</h2></a>
<p><a href="#toc.3.2"><h2>3.2&nbsp;Spring Data</h2></a>
<p><a href="#toc.3.3"><h2>3.3&nbsp;Librairie Neo4J</h2></a>
<p><a href="#toc.3.4"><h2>3.4&nbsp;Librairie OrientDB</h2></a>
<p><a href="#toc.4"><h1>4&nbsp;Les frameworks</h1></a>
<p><a href="#toc.4.1"><h2>4.1&nbsp;Apache TinkerPop</h2></a>
<p><a href="#toc.5"><h1>5&nbsp;L<font face=symbol>¢</font>exemple parfait</h1></a>
<p><a href="#toc.6"><h1>6&nbsp;Crit&egrave;res de comparaisons</h1></a>
<p><a href="#toc.7"><h1>7&nbsp;Comparaison des plus grandes BDOG</h1></a>
<p><a href="#toc.8"><h1>8&nbsp;Piste de normalisation</h1></a>
<p><a href="#toc.9"><h1>9&nbsp;Utilisation</h1></a>
<p><a href="#toc.9.1"><h2>9.1&nbsp;La persistance</h2></a>
<p><a href="#toc.9.2"><h2>9.2&nbsp;La r&eacute;cup&eacute;ration</h2></a>
<p><a href="#toc.10"><h1>10&nbsp;Schema conceptuel</h1></a>
<p><a href="#toc.11"><h1>11&nbsp;Documentation</h1></a>
<p><a href="#toc.12"><h1>12&nbsp;Processus</h1></a>
<p><a href="#toc.13"><h1>13&nbsp;Points forts</h1></a>
<p><a href="#toc.14"><h1>14&nbsp;Points faibles</h1></a>
<p><a href="#toc.15"><h1>15&nbsp;Retour d<font face=symbol>¢</font>information</h1></a>
<p><a href="#toc.16"><h1>16&nbsp;Piste de r&eacute;flexions</h1></a>
<p><a href="#toc.17"><h1>17&nbsp;Archipelago en r&eacute;sum&eacute;</h1></a>
</body>
</html>
